const result = document.querySelector(".result");
const formElement = document.querySelector(".card form");
const values = [
  [],
  [
    "",
    "កណ្ដុរ​នៅ​តាម​វាល​ស្រែ​ធាតុ​ទឹក​ស្ទឹង​​ជា​កណ្ដុរ​ភ្នែក​ធំ​នឹង​មាន​កូន​ច្រើន​តែ​ចិត្ត​បុណ្យ។",
    "កណ្ដុរ​មាស​សប្បុរស​សុទ្ធ​​ធាតុ​ទឹក​ក្នុង​ទន្លេ​ជា​សត្វ​កណ្ដុរ​ពាំ​កែវ​​មាន​បុណ្យ​វាសនា។",
    "កណ្ដុរ​តូច​ៗ​ធាតុ​ទឹក​ដែល​មនុស្ស​អាស្រ័យ​ចរចា​មិន​ពិត​តែ​ចិត្ត​បុណ្យ។",
    "កណ្ដុរ​ខ្មោច​​ធាតុ​ទឹក​ក្នុង​ព្រៃ​​រក​ស៊ី​ចិញ្ចឹម​ជីវិត​លំបាក​ចិត្ត​ខ្លាំង។",
  ],
  [
    "",
    "គោ​ឧសភរាជ​ធាតុ​ដី​លាប​ជង្រុក​​ឧត្ដម​ល្អ​និង​មាន​ទ្រព្យ​ច្រើន។",
    "គោ​ព្រៃ​​ធាតុ​ដី​ឆ្អិន​​ជា​គោ​ឡើង​ក​កាត់​ពូជ​ច្រើន​ចិត្ត​អាក្រក់​​លំបាក​ប្រើ​​ចិត្ត​​រឹង​កាល​នៅ​ពី​តូច​ល្អ។",
    "គោ​ស្រុក​​ធាតុ​ដី​ស្ងោរ​ចរចា​មិន​ពិត​ប្រាកដ​​ចិត្ត​ក្លាហាន។",
    "គោ​ស្គាំង​ស្គម​ធាតុ​ដី​ភ្នំ​​ជា​គោ​នៅ​ក្នុង​រោង​​រក​ស៊ី​លំបាក​​តែ​ចិត្ត​បុណ្យ។",
  ],
  [
    "",
    "ខ្លា​ស៊ី​មនុស្ស​​ធាតុ​ឈើ​លើ​កំពូល​ភ្នំ​​នឹង​មាន​បញ្ញា​ឈ្លាស​វៃ។",
    "ខ្លារខិន​​ជា​ធាតុ​ឈើ​ស្ងួត​​ជា​ខ្លា​អារក្ស​ទឹក​ចិត្ត​ស្មោះ​ត្រង់​ច្រើន​តែ​ទទួល​សេចក្ដី​​ទុក្ខ​ព្រួយ។",
    "ខ្លាត្រី​ធាតុ​ឈើ​ស្ទន់​នឹង​បាន​កូន​មាន​បុណ្យ​​នឹង​បាន​ពឹង​បុណ្យ​ប្រពន្ធ។",
    "ខ្លាដំបង​​ធាតុ​ឈើ​ក្រអូប​​នឹង​មាន​ទ្រព្យ​ជា​សេដ្ឋី​​ចរចា​ទៀង​ត្រង់​។",
  ],
  [
    "",
    "ទន្សាយ​ដាំ​ដូង​​ធាតុ​ឈើ​ភ្នំ​​មាន​បញ្ញា​ឈ្លាស​វៃ​។",
    "ទន្សាយ​នៅ​ក្នុង​វង្ស​ព្រះ​ចន្ទ​​ធាតុ​ឈើ​ស្ងួត​លុះ​ត្រា​តែ​លំបាក​ចិត្ត​​ទើប​បាន​ជា​អ្នក​ជា​បើ​ជា​មនុស្ស​សុចរិត​​និង​មាន​បុណ្យ​វាសនា។",
    "ទន្សាយ​ខ្វាក់​ភ្នែក​ម្ខាង​ផង​បាក់​ភ្លៅ​ខាង​ស្ដាំ​ផង​ធាតុ​ឈើ​ស្ទន់​​នឹង​មាន​កេរ្តិ៍​ឈ្មោះ​ល្បីល្បាញ។",
    "ន្សាយ​ស្គម​ស្គាំង​​ធាតុ​ឈើ​ក្រអូប​ច្រើន​តែ​លំបាក​ចិត្ត​​និង​ឈឺ​ដៃ​ជើង​​គង់​បាន​ល្អ​ក្នុង​កាល​ជា​ខាង​ក្រោយ។",
  ],
  [
    "",
    "ពស់​ថ្លាន់​ភ្ញី​ធាតុ​មាស​ទឹក​ដប់​​ជា​អ្នក​​ទៀង​ត្រង់​​ធ្វើ​រាជការ​នឹង​បាន​ជា​ធំ។",
    "ពស់​នាគរាជ​ធាតុ​ទង់​ហ្វ៊ា​​ធ្វើ​រាជការ​ល្អ​មាន​ខ្ញុំ​កំដរ​ច្រើន​​សត្រូវ​បៀតបៀន​មិន​បាន​ឡើយ។",
    "ពស់​ថ្លាន់​ធំ​ធាតុ​មាស​រាគី​នៅ​ពី​តូច​លំបាក​ចិត្ត​ធំ​ឡើង​បាន​ល្អ។",
    "ពស់​វែក​ទ្រូង​រនាម​ធាតុ​ស្ពាន់​ស​​ច្រើន​មើល​ងាយ​គេ​តែ​ចិត្ត​បុណ្យ។",
  ],
  [
    "",
    "ពស់​ស្លឹក​ឈើ​ធាតុ​ភ្លើង​ក្នុង​កែវ​ចិត្ត​បុណ្យ​នឹង​បាន​ជា​ធំ។",
    "ស្ដេច​ពស់​តូចៗ​ធាតុ​ភ្លើង​អគ្គិសនី​ច្រើន​តែ​ជា​មនុស្ស​មាន​ចិត្ត​បុណ្យ។",
    "ពស់​វែក​ដំ​បូក​​ធាតុ​ភ្លើង​គប់​​ចិត្ត​រឹង​ហើយ​មាន​បញ្ញា​ច្រើន។",
    "ពស់​វែក​ស្រងែ​ធាតុ​ភ្លើង​ក្នុង​ថ្ម​​ចិត្ត​បុណ្យ​​តែ​ច្រើន​មើល​ងាយ​គេ។",
  ],
  [
    "",
    "សេះ​ខ្ចក​ជើង​​ធាតុ​ភ្លើង​ក្នុង​កែវ​នឹង​បាន​យស​ស័ក្ដិ​ធំ​ដុំ​​ឬ​បាន​ជា​សេដ្ឋី។",
    "អស្វរាជ​(ស្ដេច​សេះ)​ធាតុ​ភ្លើង​អគ្គិសនី​មាន​បញ្ញា​ច្រើន​​ចិត្ត​បុណ្យ។",
    "សេះ​ទាល់​ច្រក​ធាតុ​ភ្លើង​គប់​ច្រើន​តែ​ចិត្ត​អ្នក​លេង​ខុស​ព្រោះ​តែ​មាត់។",
    "សេះ​មនុស្ស​ចិញ្ចឹម​​ធាតុ​ភ្លើង​ក្នុង​ថ្ម​​និង​មាន​ទ្រព្យ​សម្បត្តិ​​តែ​មិន​សូវ​ថ្កុំថ្កើង។​",
  ],
  [
    "",
    "ពពែ​ឧកញ៉ា​ចិញ្ចឹម​​ធាតុ​មាស​ទឹក​ដប់​ចិត្ត​ទន់​​ប្រកប​ដោយ​បុណ្យ​នឹង​បាន​ជា​ធំ​មាន​ធន​ធាន​ច្រើន។",
    "ពពែ​រក​ស៊ី​ដាច់​សង្វែង​ធាតុ​ទង់ហ៊ា​​ច្រើន​តែ​ចូល​ចិត្ត​រៀន​​ចំណេះ​វិជ្ជា​រក​ស៊ី​​ចិញ្ចឹម​ជីវិត​ខ្លួន​ឯង​ស្វែង​រក​លាភ​បាន​ដោយ​កម្រ។",
    "ពពែ​អ្នក​ស្រុក​ចិញ្ចឹម​​ធាតុ​មាស​រាគី​ច្រើន​តែ​បាន​ទទួល​​សេចក្ដី​ទុក្ខ​ព្រួយ។",
    "ពពែ​ខ្ចក​ជើង​​ធាតុ​ស្ពាន់​ស​ច្រើន​តែ​ឈឺ​ដៃ​ជើង​​ទឹក​ចិត្ត​ក្លាហាន​មាន​សតិ​បញ្ញា​ល្អ​ណាស់។",
  ],
  [
    "",
    "ស្វា​ព្រាហ្មណ៍​ចិញ្ចឹម​លំបាក​​ធាតុ​ដែក​ថែប​មាន​ចិត្ត​បុណ្យ​ចរចា​ទៀង​ត្រង់។",
    "ស្វា​ពោធិ​សត្វ​​ធាតុ​ដែក​ទន់​​ចិត្ត​សុភាព​ទន់​ភ្លន់​ធ្វើ​គុណ​ដល់​នរណា​មិន​បាន​ផល​តែ​បាន​នៅ​ពេល​ក្រោយ។",
    "ស្វា​ព្រៃ​​ធាតុ​មេ​ដែក​​ចិត្ត​ស្មោះ​ត្រង់​នឹង​បាន​ជា​ធំ។",
    "ស្វា​ព្រៃ​ស្មសាន​ធាតុ​ដែក​ល្អ​​ចិត្ត​ក្លាហាន​មាន​បរិវារ​ច្រើន។",
  ],
  [
    "",
    "មាន់​ពោធិ​សាត់​​ធាតុ​ដែក​ថែប​​មាន​ទ្រព្យ​​និង​មាន​បញ្ញា​​ចូល​ចិត្ត​រៀន​ចំណេះ​វិជ្ជា​ល្អ​ណាស់​ហោង។",
    "មាន់​អ្នក​ស្រុក​ចិញ្ចឹម​ធាតុ​ដែក​ទន់​​នៅ​ពី​តូច​លំបាក​ចិត្ត​​ចិត្ត​ទន់​និង​ចិត្ត​បុណ្យ​​បើ​ស្រី​ច្រើន​តែ​ខ្សត់​ស្វាមី។",
    "មាន់​ព្រៃ​ធាតុ​មេដែក​​មាន​បុណ្យ​និង​មាន​បញ្ញា​តែ​មាន​ចិត្ត​កំណាច​ឃោរឃៅ។",
    "មាន់​ខ្មោច​​ដើរ​ចរ​ច្រប់​អារ៉ប់​​ធាតុ​ដែក​ល្អ​​មិន​សូវ​មាន​បញ្ញា​​ច្រើន​តែ​ទទួល​​សេចក្ដី​លំបាក​​តែ​ចិត្ត​បុណ្យ។",
  ],
  [
    "",
    "សុនខ​កណ្ដាល​ផ្សារ​​ធាតុ​ដី​លាប​ជង្រុក​​ចិត្ត​ហ៊ាន​ល្មម​ចិញ្ចឹម​ខ្លួន​បាន។",
    "សុនខ​មនុស្ស​ចិញ្ចឹម​​ធាតុ​ដី​ឆ្អិន​នៅ​តូច​លំបាក​ចិត្ត​ច្រើន​គ្រា​ក្រោយ​បាន​ល្អ​ឡើង​វិញ។",
    "សុនខ​ដេញ​សត្វ​មាន​ម្ចាស់​ចិញ្ចឹម​​ធាតុ​ដី​ស្ងោរ​ចរចា​ទៀង​ត្រង់​​មាន​បុណ្យ​បញ្ញា​ច្រើន។",
    "ឆ្កែ​ចចក​​ធាតុ​ដី​ដំបូក​​ចិត្ត​ក្លាហាន​​ហើយ​ជា​អ្នក​កសាង​ជាតិ​។",
  ],
  [
    "",
    "ជ្រូក​ព្រៃ​ពាំ​កែវ​ធាតុ​ទឹក​ក្នុង​ស្ទឹង​​ចិត្ត​បុណ្យ​ល្អ​ណាស់​ហោង។",
    "ជ្រូក​មន្ត្រី​ចិញ្ចឹម​​ធាតុ​ទឹក​ទន្លេ​​មាន​បុណ្យ​នឹង​បញ្ញា​ច្រើន។",
    "ជ្រូក​គេ​ចិញ្ចឹម​​ក្នុង​ទ្រុង​​ធាតុ​ទឹក​​មនុស្ស​អាស្រ័យ​​មាន​បុណ្យ​និង​មាន​សេចក្ដី​ទៀង​ត្រង់។",
    "ជ្រូក​អង្គែ​ស៊ី​ធាតុ​ទឹក​ក្នុង​ព្រៃ​​ចិត្ត​បុណ្យ​ចរចា​ពាក្យ​ពេចន៍​ខ្ជាប់​ខ្ជួន។",
  ],
];
// each guess class
class Person {
  year;
  month;
  constructor(year, month) {
    this.year = year;
    this.month = month;
  }
  // get year value
  getYear() {
    return this.year;
  }
  // get month part value
  getMonthPart() {
    if (this.month >= 2 && this.month <= 4) {
      return 1;
    } else if (this.month >= 5 && this.month <= 7) {
      return 2;
    } else if (this.month >= 8 && this.month <= 10) {
      return 3;
    } else if ((this.month >= 11 && this.month <= 12) || this.month == 1) {
      return 4;
    }
  }
}

formElement.addEventListener("submit", (e) => {
  e.preventDefault();
  const yearValue = document.querySelector("#year").value;
  const monthValue = document.querySelector("#month").value;
  const per = new Person(yearValue, monthValue);
  let yearIndex = per.getYear();
  let monthIndex = per.getMonthPart();
  let temp_result = values[yearIndex][monthIndex];
  result.innerText = `លទ្ធផល ៖ ${temp_result}`;
});
